# Application Properties

---
The Application type exposes the following members.
| Name| Description
---|---|---
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
Top
#### Reference
Application Class
Autodesk.Revit.Creation Namespace